Code used for reference/app/views/interviews/index.html.erb

SELECT "participants".* FROM "participants" INNER JOIN "interviews_participants" ON "participants"."id" = "interviews_participants"."participant_id" WHERE "interviews_participants"."interview_id" = ?  [["interview_id", 1]]
---
        <td><%= interview.interviewDate %></td>
        <td><%= interview.participants.map(&:name).join(', ') %></td>