Code used for reference/app/views/participants/show.html.erb

  <strong>Interview titles: </strong>
  <%= @participant.interviews.map(&:title).join(', ') %>
---
SELECT "interviews".* FROM "interviews" INNER JOIN "interviews_participants" ON "interviews"."id" = "interviews_participants"."interview_id" WHERE "interviews_participants"."participant_id" = ?  [["participant_id", 5]]