app/views/interviews/_form.html.erb

SELECT "interviews".* FROM "interviews"
SELECT "participants".* FROM "participants"
---
    <%= form.label :participants %>
    <%= collection_select(:interview, :participant_ids, Participant.all, :id, :email, {}, { :multiple => true } )%>