app/views/interviews/show.html.erb

  <strong>Participants:</strong>
  <%= @interview.participants.map(&:name).join(', ') %>
---
SELECT "participants".* FROM "participants" INNER JOIN "interviews_participants" ON "participants"."id" = "interviews_participants"."participant_id" WHERE "interviews_participants"."interview_id" = ?  [["interview_id", 5]]