Code used for reference/app/controllers/interviews_controller.rb

SELECT "interviews".* FROM "interviews"
---
  def index
    @interviews = Interview.all

SELECT "interviews".* FROM "interviews"
SELECT  "participants".* FROM "participants" WHERE "participants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "interviews" ("startTime", "endTime", "interviewDate", "title", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
SELECT "interviews".* FROM "interviews" INNER JOIN "interviews_participants" ON "interviews"."id" = "interviews_participants"."interview_id" WHERE "interviews_participants"."participant_id" = ?  [["participant_id", 1]]
---
  def create
    @interview = Interview.new(interview_params)
    params[:interview][:participant_ids].each do |participant_id|
      unless participant_id.empty?
      participant = Participant.find(participant_id)
        @interview.participants << participant
      end
    end
    respond_to do |format|
      if @interview.save
        d = @interview.interviewDate
        t = @interview.startTime
        start = DateTime.new(d.year,d.month,d.day,t.hour,t.min,t.sec,t.zone).utc.to_i

SELECT "interviews".* FROM "interviews"
SELECT  "participants".* FROM "participants" WHERE "participants"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "interviews" SET "updated_at" = ?, "endTime" = ?, "interviewDate" = ? WHERE "interviews"."id" = ?  [["updated_at", "2020-01-07 11:08:26.426857"], ["endTime", "2000-01-01 16:35:00"], ["interviewDate", "2020-01-18"], ["id", 23]]
SELECT "participants".* FROM "participants" INNER JOIN "interviews_participants" ON "participants"."id" = "interviews_participants"."participant_id" WHERE "interviews_participants"."interview_id" = ?  [["interview_id", 23]]
---
  def update
    params[:interview][:participant_ids].each do |participant_id|
      unless participant_id.empty?
      participant = Participant.find(participant_id)
        @interview.participants << participant
      end
    end
    respond_to do |format|

      if @interview.update(interview_params)
        participants = @interview.participants
        emails = []
        participants.each do |p|

DELETE FROM "interviews" WHERE "interviews"."id" = ?  [["id", 33]]
---
  def destroy
    @interview.destroy

SELECT  "interviews".* FROM "interviews" WHERE "interviews"."id" = ? LIMIT ?  [["id", 39], ["LIMIT", 1]]
---
    def set_interview
      @interview = Interview.find(params[:id])