app/views/participants/index.html.erb

SELECT "interviews".* FROM "interviews" INNER JOIN "interviews_participants" ON "interviews"."id" = "interviews_participants"."interview_id" WHERE "interviews_participants"."participant_id" = ?  [["participant_id", 1]]
---
        <td><%= participant.role %></td>
        <td><%= participant.interviews.map(&:title).join(', ') %></td>