Code used for reference/app/models/interview.rb

	def time_overlap
		for participant in participants
			prevInterviews = participant.interviews
			prevInterviews.each do |interview|
---
SELECT "interviews".* FROM "interviews" INNER JOIN "interviews_participants" ON "interviews"."id" = "interviews_participants"."interview_id" WHERE "interviews_participants"."participant_id" = ?  [["participant_id", 1]]