app/controllers/interviews_controller.rb

  def update
    params[:interview][:participant_ids].each do |participant_id|
      unless participant_id.empty?
      participant = Participant.find(participant_id)
        @interview.participants << participant
      end
    end
    respond_to do |format|

      if @interview.update(interview_params)
        participants = @interview.participants
        emails = []
        participants.each do |p|
---
SELECT "participants".* FROM "participants" INNER JOIN "interviews_participants" ON "participants"."id" = "interviews_participants"."participant_id" WHERE "interviews_participants"."interview_id" = ?  [["interview_id", 23]]