app/controllers/interviews_controller.rb

  def create
    @interview = Interview.new(interview_params)

    respond_to do |format|
      if @interview.save
---
INSERT INTO "interviews" ("startTime", "endTime", "interviewDate", "participants", "title", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @interview.update(interview_params)
---
UPDATE "interviews" SET "updated_at" = ? WHERE "interviews"."id" = ?  [["updated_at", "2020-01-07 09:18:43.206633"], ["id", 14]]

  def destroy
    @interview.destroy
---
DELETE FROM "interviews" WHERE "interviews"."id" = ?  [["id", 1]]

    def set_interview
      @interview = Interview.find(params[:id])
---
SELECT  "interviews".* FROM "interviews" WHERE "interviews"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]