app/controllers/participants_controller.rb

SELECT "participants".* FROM "participants"
---
  def index
    @participants = Participant.all

INSERT INTO "participants" ("name", "role", "created_at", "updated_at", "email") VALUES (?, ?, ?, ?, ?)  [["name", "Interviewer"], ["role", "Equal"], ["created_at", "2020-01-07 07:39:50.112008"], ["updated_at", "2020-01-07 07:39:50.112008"], ["email", "aswanth9495@gmail.com"]]
---
  def create
    @participant = Participant.new(participant_params)

    respond_to do |format|
      if @participant.save

UPDATE "participants" SET "email" = ?, "updated_at" = ? WHERE "participants"."id" = ?  [["email", "interviewer@gmail.com"], ["updated_at", "2020-01-07 07:40:29.669205"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @participant.update(participant_params)

SELECT  "participants".* FROM "participants" WHERE "participants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_participant
      @participant = Participant.find(params[:id])