app/models/interview.rb

	def time_overlap
		for participant in participants
			prevInterviews = participant.interviews
			prevInterviews.each do |interview|
---
SELECT "interviews".* FROM "interviews"